#include <stdio.h>

int main(){
    
    float ounces; 
    
    printf("Enter your ounce: ");
    scanf("%f", &ounces);

    printf("You ordered  %.2f cups.",ounces / 8); 

    return 0;
}

/*Задача 2. След излизането от Еврозоната Великобритания въвежда отново
унцията като мерна единица в заведенията за обществено хранене. Чашата
има обем 8 унции. Напишете програма, която да пита потребителя колко
унции желае и тя да връща броя на чашите, които е поръчал.*/